cases/RedBull_160deg/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}

// Red Bull-style 160 deg flap motion:
//
// Prescribed mesh rotation: +160 deg
//
// 0.000–0.050 s: hold initial position
// 0.050–0.450 s: smooth prescribed rotation
// 0.450 s onward: hold final position

mover
{
    type            motionSolver;

    libs            ("libfvMotionSolvers.so");

    motionSolver    solidBody;

    cellZone        rotor;

    solidBodyMotionFunction  rotatingMotion;

    origin          (0.290000 0.050000 0.100000);
    axis            (0 0 1);

    omega           table
    (
            (0.000000 -0.000000000000)
            (0.050000 0.000000000000)
            (0.060000 0.860842817552)
            (0.070000 1.716378252880)
            (0.080000 2.561331645520)
            (0.090000 3.390493576832)
            (0.100000 4.198751987800)
            (0.110000 4.981123696528)
            (0.120000 5.732785121280)
            (0.130000 6.449102019416)
            (0.140000 7.125658059048)
            (0.150000 7.758282047232)
            (0.160000 8.343073646704)
            (0.170000 8.876427422792)
            (0.180000 9.355055072104)
            (0.190000 9.776005696032)
            (0.200000 10.136683993984)
            (0.210000 10.434866264328)
            (0.220000 10.668714114200)
            (0.230000 10.836785793856)
            (0.240000 10.938045085496)
            (0.250000 10.971867691912)
            (0.260000 10.938045085496)
            (0.270000 10.836785793856)
            (0.280000 10.668714114200)
            (0.290000 10.434866264328)
            (0.300000 10.136683993984)
            (0.310000 9.776005696032)
            (0.320000 9.355055072104)
            (0.330000 8.876427422792)
            (0.340000 8.343073646704)
            (0.350000 7.758282047232)
            (0.360000 7.125658059048)
            (0.370000 6.449102019416)
            (0.380000 5.732785121280)
            (0.390000 4.981123696528)
            (0.400000 4.198751987800)
            (0.410000 3.390493576832)
            (0.420000 2.561331645520)
            (0.430000 1.716378252880)
            (0.440000 0.860842817552)
            (0.450000 0.000000000000)
            (10.000000 -0.000000000000)
    );
}

// ************************************************************************* //
