cases/RedBull_160deg/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         cellLimited Gauss linear 1;
}

divSchemes
{
    default                             none;

    div(phi,U)                          bounded Gauss upwind;
    div(phi,k)                          bounded Gauss upwind;
    div(phi,omega)                      bounded Gauss upwind;

    div((nuEff*dev2(T(grad(U)))))       Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 0.5;
}

wallDist
{
    method          meshWave;
}

fluxRequired
{
    default         no;
    p;
}

// ************************************************************************* //
