cases/RedBull_160deg/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      createBafflesDict;
}

internalFacesOnly true;

baffles
{
    circularNCC
    {
        type        faceZone;
        zoneName    circularInterface;

        owner
        {
            name    nonCouple1;
            type    patch;
        }

        neighbour
        {
            name    nonCouple2;
            type    patch;
        }
    }
}

// ************************************************************************* //
